In [137]:
import json
import requests
import matplotlib.pyplot as plt
import pandas as pd

In [138]:
endpoint = 'https://data.nashville.gov/resource/fuaa-r5cm.json'

In [139]:
response = requests.get(endpoint)

In [140]:
response

Make an API request that returns the months where "fire" was searched in 2016. Which month had the most searches?

In [141]:
params = {
    "Year": "2016",
    "Query Text": "fire"
}

In [142]:
response = requests.get(endpoint, params = params)

In [143]:
response

In [144]:
res = response.json()
res

[{'month_name': 'January',
  'year': '2016',
  'query_count': '19',
  'query_text': 'fire'},
 {'month_name': 'February',
  'year': '2016',
  'query_count': '35',
  'query_text': 'fire'},
 {'month_name': 'March',
  'year': '2016',
  'query_count': '32',
  'query_text': 'fire'},
 {'month_name': 'April',
  'year': '2016',
  'query_count': '26',
  'query_text': 'fire'},
 {'month_name': 'May',
  'year': '2016',
  'query_count': '24',
  'query_text': 'fire'},
 {'month_name': 'June',
  'year': '2016',
  'query_count': '31',
  'query_text': 'fire'},
 {'month_name': 'July',
  'year': '2016',
  'query_count': '24',
  'query_text': 'fire'},
 {'month_name': 'August',
  'year': '2016',
  'query_count': '47',
  'query_text': 'fire'},
 {'month_name': 'September',
  'year': '2016',
  'query_count': '36',
  'query_text': 'fire'},
 {'month_name': 'October',
  'year': '2016',
  'query_count': '38',
  'query_text': 'fire'},
 {'month_name': 'November',
  'year': '2016',
  'query_count': '32',
  'query_text': 'fire'},
 {'month_name': 'December',
  'year': '2016',
  'query_count': '38',
  'query_text': 'fire'}]

In [145]:
query_fire = pd.DataFrame(res)
query_fire

   month_name  year query_count query_text
0     January  2016          19       fire
1    February  2016          35       fire
2       March  2016          32       fire
3       April  2016          26       fire
4         May  2016          24       fire
5        June  2016          31       fire
6        July  2016          24       fire
7      August  2016          47       fire
8   September  2016          36       fire
9     October  2016          38       fire
10   November  2016          32       fire
11   December  2016          38       fire

In [146]:
print(query_fire[query_fire['query_count'] == query_fire['query_count'].max()])

  month_name  year query_count query_text
7     August  2016          47       fire

2. Make an API request that returns all the times a query was run more than 100 times in a month. How many times did this occur?

In [151]:
endpoint2 = 'https://data.nashville.gov/resource/fuaa-r5cm.json/'

response2 = requests.get(endpoint2)
response2

In [180]:
res2 = response2.json()

In [181]:
 high_queries = pd.DataFrame(res2)
high_queries

    month_name  year query_count               query_text
0      January  2014         223                     ebid
1      January  2014         112            property maps
2      January  2014          97                     maps
3      January  2014          90             property tax
4      January  2014          76                     jobs
..         ...   ...         ...                      ...
995   February  2014           7                pay stubs
996   February  2014           7        school lunch menu
997   February  2014           7  contractors permit bond
998   February  2014           7                    media
999   February  2014           7                 pay plan

[1000 rows x 4 columns]

In [182]:
#trying to filter but error leads me to think query count col is str
#high_queries = high_queries[high_queries["query_count"]> 100] so will change to int
#high_queries['query_count'] = high_queries['query_count'].astype(float)
high_queries['query_count'] = pd.to_numeric(high_queries['query_count'])
high_queries.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   month_name   1000 non-null   object
 1   year         1000 non-null   object
 2   query_count  1000 non-null   int64
 3   query_text   1000 non-null   object
dtypes: int64(1), object(3)
memory usage: 31.4+ KB

In [187]:
#high_queries = high_queries[high_queries["query_count"]> 100]
print(len(high_queries[high_queries['query_count'] > 100]))

12